oh-my-fish/plugin-config
oh-my-fish/plugin-emacs
fishingline/safe-rm
h-matsuo/fish-color-scheme-switcher
Kristoffer-PBS/fishman
bouk/babelfish
jorgebucaran/autopair.fish
franciscolourenco/done
jorgebucaran/replay.fish
daleeidd/fish-git-ignore
ohmree/cwcr
